BackwardCases/QHDTests/Backward-facingStep-FourbledRe100/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       11639.6;
    }
    thermodynamics
    {
        Hf              0.0;
        Sf              0.0;
        Cp              1.4;
        Cv              1;
    }
    transport
    {
        mu              0.001;
        Pr              1;
        beta            0.003655;
    }
}

QGD
{
    implicitDiffusion true;
    QGDCoeffs alphaHbyUQHD;
    alphaHbyUQHDDict
    {
        UQHD 0.1;
    }
}


// ************************************************************************* //
